// שם הלומדה
const TITLE = 'בה"ד 11 - מבט מבפנים';

//  Max number of question in exam. Make sure it isn't more than the number of questions we have!
const AMOUNT_EXAM_QUESTIONS = 10;

const TIME_FOR_EXAM = "11:00";


/*              Edit notes:
    1. Valid card types: youtube, video-and-text, pic-and-text, text, listNumbers, listDots
    2. Title class: "sub-title" , list class: "list", place on the outer element <ol> or <ul> 

                        HOW TO CREATE NEW COLOR
            search for the listed colors and switch to the desired ones
    1. Primary color: #ADE8F4;
    2. Secondary color: #8edef7;
    3. Text color: #3a0606
    4. Open image + gradient color: #fff6f6c7;
            */
    
    /* amountOfQuestions - max number of questions from the subject that will appear in the test*/
const DATA = { 
    "רקע על הבה\"ד": {
        "icon":  "../assets/images/bahad11-ver2.png",
        "learningContent": {
        'קצת על הבה"ד...': {
                "רקע": [ 
                    {
                        cardType: "text",
                        content: '<br>בה״ד 11, בית הספר למקצועות משאבי האנוש, הוקם בשנת 1949 תחילה במחנה צריפין. <br><br> באוגוסט 2015 עבר הבה״ד לקריית ההדרכה על שם האלוף אריאל שרון (עיר הבה״דים) כחלק מתכנית העתקת בסיסי צה״ל לנגב.<br><br> המעבר שיפר את תשתיות הבה״ד והגביר את שיתופי הפעולה עם בסיסי הדרכה אחרים.'
                    },
                    {
                        cardType: "text",
                        content: '<br>בה״ד 11 הוא בסיס הכשרה, הדרכה ואימונים של חיל משאבי אנוש לכל תפקידי המשא״ן וכן נערכות בו גם הכשרות והדרכות של חיל הרבנות הצבאית והחיל הכללי. <br><br>בבה״ד מוכשרים חיילים וקצינים בדרגות שונות, מרמת טירון בהכשרת יסוד ועד לדרג סא״ל בהכשרות מתקדמות ונגדים בכירים.' 
                    }
                ],
                'חזון הבה"ד': [
                    {
                        cardType: "text",
                        content: '<br>בה"ד 11 הוא בית הספר המרכזי ל"אנשים שמטפלים באנשים" אשר עושים זאת מתוך תחושת שליחות, ערכים ואמונה כי האדם הוא המשאב החשוב ביותר לכשירות צה"ל ונצחונו.<br><br>זאת על גבי תכנון שיטתי והדרכה מתקדמת הרואה בשירותיות ערך מוביל המבוסס על נבחרת אנשים מצוינת.',
                    },
                    {
                        cardType: "listDots",
                        numList: "5",
                        li1: "אהבה",
                        li2: "כנות",
                        li3: "חדשנות",
                        li4: "תשוקה",
                        li5: "מצוינות"
                    }
                ],
               
            }
        },
    },
    "סקירת ההכשרות השונות": {
        "icon":  "../assets/images/bahad11-ver2.png",
        "learningContent": {
            'מגמות הבה"ד': {
                "מגמת השלמת קצונה": [
                    {
                        cardType: "text",
                        content: '<br>השלמת חיל משאבי אנוש מכשירה את הדור הבא של קציני חיל משאבי האנוש.<br><br>ההשלמה אורכת כ-10 שבועות ובנויה בשלוש פלוגות ו-17 צוותים.<br><br> מפקדות הפלוגה בתפקיד שלישי בציר הליבה של החיל, ומפקדות הצוותים משרתות בהשלמה בתפקיד שני.  <br><br>'                       
                    },
                    {
                        cardType: "text",
                        content: '<br>ההשלמה מורכבת משלוש לבנות מרכזיות: לבנת המבואות, לבנת המלחמה ולבנת ההתמחויות. <br><br> צוערי ההשלמה מגיעים מכלל מערכי החיל: משא"ן סדיר, מילואים, ת"ש, נפגעים, מטה, משא"ן חיל הים (במהלך ההשלמה מתבצע שת"פ ביחד עם צוערי השלמת משא"ן חה"א ואמ"ן).  <br><br>בנוסף ישנה פלוגת השלמה של צוערי החיל הכללי ממערכי מדעי ההתנהגות, חטיבת תבל, מפא"ת וחטיבת הסגל. <br><br>'
                    },
                    {
                        cardType: "text",
                        content: '<br>בלבנת המבואות והמלחמה כלל הצוערים מעורבבים בצוותים בכלל המערכים ולאחר לבנת המלחמה הצוערים מחולקים להתמחויות שונות לפי התפקידים אליהם ישובצו בסיום ההשלמה. <br><br> אבני הייסוד של ההשלמה הם:\
                         <br>•דמות המפקד\
                         <br>•מקצוע הטיפול בפרט כראשית הצירים\
                          <br>•שריר החוסן והאיתנות'
                    },

                ],
                "מגמת הפיקוד": [
                    {
                        cardType: "text",
                        content: '<br>מגמת הפיקוד מכילה 3 פלוגות:<br> \
                        2 פלוגות ייעודי לקצונה ופלוגת הכנה לקצונה.<br><br> \
                        <b>קורס ייעודי לקצונה</b> הינו קורס יסוד אשר מכשיר את חניכי הייעודי למקצועות המשא"ן השונים \
                        (ת"ש, סדיר, מילואים ונפגעים) תוך הסתכלות עתידית ליציאתם לקורס הקצינים.'
                    },
                    {
                        cardType: "text",
                        content: '<br><b>קורס פ"ז (פיקוד זוטר)</b> הינו קורס הכנה לקצונה המכיל כ-230 חניכים אשר מתוכן עתידים להיקלט לבה"ד 1 כ-150 חניכים. \
                        <br>מטרת קורס ההכנה לקצונה הוא להכין את החניכים לקראת בה"ד 1, בדגש על בוחן הסף. \
                        <br>כאן הם מקבלים כלים פיקודיים להמשך הדרך לקראת יציאתם לקצונה, שיפור מדדי חוסן, העלאת מוטיבציה, \
                        מעבר מבחנים, כש"ג וכדומה.'
                    },
                    {
                        cardType: "text",
                        content: '<br>המגמה מבוססת ברובה על קצינים: \
                        <br>•1 מפקדת המגמה (סרן)\
                        <br>•3 מ"פים (סרן קבע)\
                        <br>•16 מפק"צים (סר"ח) \
                        <br>•4 מפקדים (חובה) \
                        <br><br>המגמה מלווה את חיילי הייעודי מהיותם טירונים ועד סיום בה"ד 1. \
                        <br>את חיילי המיצוי מלווה מרגע קליטת בסמ"ח ועד סיום בה"ד 1.'
                    },
                    {
                        cardType:"videoAndText",
                        content: " ",
                        video: '../assets/images/video-pikud.mp4',
                    }
                ],
                'מגמת משא"ן': [
                    {
                        cardType: "text",
                        content: `מדור משאבי אנוש בבה״ד בפיקוד קצינה בדרגת רס״ן ות״פ 5 קצינות סר״ח-
                                  <br> ע׳ רמד משא״ן- מתפקדת כקצינת משא״ן יחידה ובנוסף ק משאן מילואים ביחידה.
                                  <br> ק׳ סגל- אחראית על פיתוח הקצינים והנגדים בבה״ד ואיתור ומיון סגלי ההדרכה.
                                  <br> ק׳ חינוך - אחראית על תוכנית החינוך בהכשרות וסגלי הבה״ד.
                                  <br ק׳ ת״ש - אחראית על טיפול בתנאי השירות של סגלי הבה״ד ומתן מענה להכשרות השונות.
                                  <br> ק׳ קורסים- מהווה קצינת משא״ן ליחידות ההכשרה בבה״ד, מובילה את תחום הגיוסים וההכשרות בבה״ד.
                                  <br> מדור המשא״ן עוסק בטיפול וטיפוח האנשים, פיתוחם והכשרתם.`
                    },
                ],
                'גפ"ה': [
                    {
                        cardType: "text",
                        content: `גוף פיתוח הדרכה של הבה״ד הוקם ביולי 2024 במבנה של רס״ן ו4 מדורים- פיתוח הדרכה, צפ״ה, פל״א וסושיאל ניהול ידע.
                                  <br> הגפ״ה המסייע לבה״ד להוביל את ההדרכה קדימה על גבי כלים פרקטיים ולמידה עדכנית.
                                  <br> גפ״ה מנחה מקצועית לנושאי ההדרכה ומטייב את תכניות ההכשרה.
                                  <br> כמו כן אמון על ניהול,פיתוח והכשרת הסגל.
                                  <br> הגפ״ה שואף למקצועיות וקידום הדרכה חדשנית.`
                    },
                ],  
                'מד"ריה': [
                    {
                        cardType: "text",
                        content: `מדור האחראי על תחום התכנון התיאום והמשאבים בבה״ד .
                                 <br>המדור בפיקוד קצינה בדרגת רס״ן אשר תחת פיקודה:
                                 <br> מ״פ מפקדה (תקן נגד מובהק)
                                 <br> נגדת תכנון ותיאום (תקן נגד ראשוני)
                                 <br> קמב״צ- (תקן סר״ח)
                                 <br> מדור זה עוסק בתכנון הגרף השנתי, תיאום המעטפת לכלל הכשרות הבה״ד ותמיכתן לאורך השנה, אחרי על תכנון המשאבים והקצאתם, גרף הפעלות ומשימות חיל/ אכ״א, מתן מעטפת תקשובית ואמון על תחום ביטחון המידע.`
                    },
                ],                  
                "בית הספר למקצועות הרבנות": [
                    {
                        cardType: "text",
                        content: '<br>בית הספר למקצועות הרבנות בנוי מ:\
                        <br><br>•מפקד בית הספר למקצועות הרבנות\
                        <br>•3 ממ"גים (למגמות חוגרים, קצינים ונגדים)\
                        <br>•2 מק"סים\
                        <br>•תקינה של 12 מ"כים\
                        <br><br><br> במעבר לדף הבא תוכלו להרחיב בקריאה על המגמות השונות'
                    },
                    {
                        cardType: "text",
                        content: '<br><b>מגמת חוגרים</b> \
                        <br>ההכשרה אורכת כ-7 שבעות במסגרתה החניכים עוברים טירונות של שלושה שבועות שכוללת שיעורי רובאות, לילה בשטח ועוד.\
                        <br>הטירונות מסתיימת בטקס השבעה. \
                        <br><br>לאחר סיום הטירונות מתבצע מעבר לפרק המקצועי במסגרתו החניכים יעברו מטירונים לרכזי מורשת ורוח, רכזי רבנות או משגיחי כשרות.\
                        <br><br>בפרק המקצועי הם ירכשו מיומנויות, ידע וכלים מקצועיים לביצוע משימתם, יסיירו בבסיסים על מנת לקבל את החוויות ויום בחיי כל אחד מהמקצועות שציינו.\
                        <br><br>במהלך ההכשרה הם יפגשו אנשי מקצועי, ראשי ענפים ותחומים ברבנות על מנת לקבל מהם את כל הכלים המקצועיים וראיית השלם בהכשרה.\
                        <br><br>בנוסף, המגמה אחראית על השתלמויות מקצועיות לאוכלוסיית החוגרים וקורסי מיצוי לאורך השנה.'
                    },
                    {
                        cardType: "text",
                        content: '<br><b>מגמת קצינים</b>\
                        <br>אחראית על השתלמויות מקצועיות לאוכלוסיית הרבנים הצבאיים וקציני הדת ועל הכשרות מקצועיות בדרג השטח.<br><br><br>\
                        <b>מגמת נגדים</b>\
                        <br>אחראית על קורס כניסה לקבע לנגדים, השתלמויות מקצועיות והעצמת אוכלוסיית נגדי הכשרות.'
                    }
                ],
                "מגמת פסיכוטכני": [
                    {
                        cardType: "text",
                        content: '<br>קורס מראיינים פסיכוטכניים אורך כשלושה חודשים ומכשיר את החניכים לביצוע הריאיון הפסיכוטכני בצו הראשון. \
                                <br><br>במהלך הקורס נלמדת תורת הריאיון, תחילה באופן עיוני והחל משלב מוקדם בקורס הלמידה מתבססת על התנסויות מעשיות, \
                                תרגול הכלי על חיילים ביחידות שונות וסימולציות.'
                    },
                    {
                        cardType: "text",
                        content: '<br>במהלך ההכשרה ישנם ימי שיא רבים, אשר נועדו להכין את החיילים בצורה המיטבית לשירות הסדיר- \
                                בו יפגשו אוכלוסיות רבות ומגוונות. \
                                <br><br>החיילים שומעים הרצאות, יוצאים לסיורים במוסדות שונים על מנת להכיר סוגי אוכלוסיה כמו נוער בסיכון ואף מגיעים \
                                לכלא הצבאי ומתרגלים את כלי הריאיון על הכלואים.'
                    },
                ],
                'מגמת שירות-מד"ה': [
                    {
                        cardType: "text",
                        content: '<br>המגמה אחראית על הכשרת שני תפקידים:\
                         <br><b>נציגי/ות שירות</b> ו- <b>מאבחנות מדעי ההתנהגות</b>  \
                         <br><br>במעבר לדף הבא תוכלו לקרוא על התפקידים השונים'
                    },
                    {
                        cardType: "text",
                        content: '<br>מקצוע <b>נציג השירות</b> מעוצב מחדש בימים אלה, כהמשך ישיר של עמ"ט השירות. \
                                  <br><br>הכשרת נציגי השירות גם היא בבנייה, ובימים אלה מתקיים מחזור הפיילוט השלישי למתכונת ההכשרה החדשה. \
                                  <br><br>הטירונות וההכשרה לתפקיד מתקיימות בבה״ד 11;\
                                  <br>טירונות 02 שאורכת כ-3 שבועות וקורס מקצועי שאורכו הוא כשבועיים, המשלב לימוד תאוריה ומעשי. \
                                  <br><br>בסיום ההכשרה מתפזרות אל הבסיסים אליהן שובצו על מנת להתחיל את השירות הסדיר, ביניהם: מוקד מופת, קפ"ץ, מקמש"ר ועוד.'
                    },
                    {
                        cardType: "text",
                        content: '<br><b>מאבחנות מדעי ההתנהגות</b> שותפות לתהליכים שמובילים אנשי המקצוע של המערך- יועצים ארגוניים, פסיכולוגים וסוציולוגים. \
                                  <br><br>הטירונות וההכשרה לתפקיד מתקיימות בבה״ד 11;\
                                  <br>טירונות 02 שאורכת כ-3 שבועות וקורס מקצועי שאורכו הוא כ-5 שבועות ובכל שבוע עוסקים בפרקטיקה אחרת. \
                                  <br><br>בסיום ההכשרה מקבלות המאבחנת שרוך חום, סיכת יחפצ״ון ותג עליו רשום "מאבחנת מדעי ההתנהגות״ ומתפזרות אל הבסיסים אליהן שובצו על מנת להתחיל את השירות הסדיר.'
                    },
                                        
                ],
                'מדור הכשרות מתקדמות': [
                    {
                        cardType: "text",
                        content: '<br>מדור הכשרות מתקדמות מכשיר את הקצינים והנגדים בחיל המשא״ן. \
                                <br><br><b>מסגרת קצינים</b>- מכשירה את כלל הקצינים החל מדרגת הסגן ועד לדרגת הסא״ל בהתאם לסיכומי וועדות הסרנים ודיוני השיבוץ של הקצינים. \
                                <br><br><b>מסגרת נגדים</b>- מכשירה את כלל הנגדים החל מקורס כניסה לקבע, \
                                ועד לשלבים המקצועיים במקצועות נגדי המשא״ן (עולם סדיר, מילואים ומטה) ונגדי היחידה.'
                    },
                    {
                        cardType: "text",
                        content: '<br>הכשרות הליבה במדור הכשרות מתקדמות הן:\
                                <br> <br>•קורס קמש״גים\
                                <br>•קורס קמש״חים\
                                <br>•קורס משא״ן בכיר/מתקדם \
                                <br>•השתלמות סא״לים \
                                <br>•שלבים מקצועיים לנגדי המשא״ן ולנגדי היחידה\
                                <br>• השתלמות רנ״גים\
                                <br>•שמירות כשירות מותאמות דרג\
                                <br>• ועוד \
                                <br><br>במסגרת ההכשרות החניכים עוברים שיעורים מקצועיים, סימולציות, ביקורים ביחידות קצה, \
                                <br>פאנל בע״ת, סדנאות, סיורים חינוכיים ומגוון רב של הרצאות בכירים בחיל ובאכ״א.'
                    },
                ],
                'מגמת ת"ש נפגעים': [
                    {
                        cardType: "text",
                        content: '<br>ההכשרה אורכת כ-9 שבועות. \
                                <br>במסגרתה עוברים החניכים טירונות 02 על בסיס טירונות מגל. \
                                <br><br>המעבר בין הטירונות לקורס המקצועי קורה לאחר טקס ההשבעה. \
                                <br><br>לאחר סיום הטירונות מתחילים החניכים קורס מקצועי שאורך כ-6 שבועות, \
                                במסגרתו לומדים החניכים את מקצוע מש״ק ת״ש או מש״ק נפגעים בהתאם לשיבוצו טרם הגיוס.\
                                <br><br>בהכשרה החניכים עוברים סימולציות המדמות מצבי אמת בתפקידם העתידי, \
                                <br>סיורים מקצועיים, סיפוחים ביחידות השונות, פאנל מש״קים מיחידות שונות בצה״ל, \
                                תכנים ושיעורים עיוניים שיכשירו אתם לתפקידם בשירות הסדיר.'
                    },
                    {
                        cardType:"videoAndText",
                        content: " ",
                        video: '../assets/images/video-tash.mp4',
                    }
                ]
            }
        }
    }
   
};



/********************************************************************************************************/
/********************************************************************************************************/
/********************************************************************************************************/
/*****  אובייקטים לפי סוג הכרטיסייה המכניסים את התוכן של כל כרטיסייה אל תוך הכרטיסייה  ********/

/**
 * # @type {{[index: string]: {init: (card: HTMLElement, json: any) => void}}}
 */
let CARD_TYPES = {};

CARD_TYPES.text = {
    init(card, json) {
        if (!json.content) {
            throw new Error(`Missing content in cardType text`);
        }
        card.querySelector(".content").innerHTML = json.content;
    }
}

CARD_TYPES.picAndText = {
    init(card, json) {
        card.querySelector(".pic").src = json.pic;
        card.querySelector(".content").innerHTML = json.content;
        if (!json.content) {
            card.querySelector(".content").remove();
        }
    }
}

CARD_TYPES.videoAndText = {
    init(card, json) {
        // console.log("Initializing video-and-text card with:", json);
        card.querySelector(".video").src = json.video;
        card.querySelector(".content").innerHTML = json.content;
        if (!json.content) {
            card.querySelector(".content").remove();
        }
    }
};


CARD_TYPES.youtube = {
    init(card, json) {
        if (!json.youtube.includes("embed")) {
            throw new Error("Make sure all youtube links are ment to be embedded and not watched");
        } else {
        card.querySelector(".youtube").src = json.youtube;
        card.querySelector(".content").innerHTML = json.content;
            if (!json.content) {
                card.querySelector(".content").remove();
            }
        }
    }
}

CARD_TYPES.listDots = {
    init(card, json) {
        for (let num = 1; num <= Number(json.numList); num++) {
            card.querySelector(".list").innerHTML += `<li>${json["li"+num]}</li>`;
        }
    }
}
CARD_TYPES.listNumbers = {
    init(card, json) {
        for (let num = 1; num <= Number(json.numList); num++) {
            card.querySelector(".list").innerHTML += `<li>${json["li"+num]}</li>`;
        }
    }
}

